app/controllers/songs_controller.rb

  def upload
  CSV.foreach(params[:leads].path, headers: false) do |lead|
    Song.create(song_title: lead[0], artist_name: lead[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-07-25 22:43:44.467340"], ["updated_at", "2018-07-25 22:43:44.467340"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-07-25 22:43:44.476264"], ["updated_at", "2018-07-25 22:43:44.476264"]]